import { Link } from "react-router-dom";
import { Typography, Divider } from "@mui/material";
import Container from "@mui/material/Container";

export const WelcomeText = () => {
  return (
    <Container sx={{
      maxWidth: { xs: '90%', sm: '80%', md: '70%', lg: '65%' },
      border: '1px solid #fbbc05',
      boxShadow: '0px 6px 13px -6px rgba(0,0,0,0.55)',
      background: 'white',
      padding: { xs: 2, sm: 3, md: 4 },
      margin: '40px auto',
    }}>
      <Typography variant="subtitle1" align='left' m='2' p='2'>
        Добре дошли в красивия и слънчев курорт, Поморие! Време е градът ни да има информационен
        сайт, който да служи, като пътеводител за гостите на град Поморие и да отговаря с актуална информация
        на най-важните за туристите въпроси.
        Този сайт е направен с <b>нестопанска цел</b> от гражданин на Поморие и е абсолютно
        <b> потребителски ориентиран.</b> Много от снимките в сайта са мое дело. Благодаря на Павлин Кулов, Борис Кратман, Атанас Железчев - Насека и 
        Чавдар Чернев, че се съгласиха да публикувам техни фотографии от Поморие в раздел <Link to='/beauty-of-pomorie'>'Красотата на Поморие'</Link>. Използвани са и снимки от 
        <Link to='https://www.pomorietourism.bg/' target='_blank'> Туристическия портал на Поморие</Link>.
        <Divider sx={{margin: '30px 0'}}/>
        <b>Тук ще намерите информация за:</b>
        <ul>
          <li>Музеи, читалища, библиотеки, интернет клубове, копирни услуги и т.н.</li>
          <li>Къде да паркирам и на какви цени? Актуално за платените и безплатните паркинги, синя зона.</li>
          <li>Колко струват чадърите и шезлонгите този сезон? Актуална информация за плажовете в града.</li>
          <li>Къде да играят децата ми? Детски кътове, площадки, игрища.</li>
          <li>Къде да се разхождам или спортувам?</li>
          <li>Какви атракциони има в Поморие и колко струват? Корабчета, влакче, лунапарк, кино и други.</li>
        </ul>
      </Typography>
    </Container>
  );
};
